wmsmobile/src/Documents/итНаборка/итНаборка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итНаборка</name>
  <attributes>
    <name>ГУИД</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаборки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>155</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FSRARID</name>
    <comment>ид для печати SSCC</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РозничныйПризнак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесНаборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОчередьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихКодыЯчеекДокумента</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихКод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

wmsmobile/src/InformationRegisters/ИтЗадачиНаТСД/ИтЗадачиНаТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИтЗадачиНаТСД</name>
  <resources>
    <name>ИдентификаторУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>172</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаОтправитель</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаОтправительПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаПолучатель</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ЯчейкаПолучательПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.итWMSСостоянияЗадачТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеДокументаТСД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.итНаборка</types>
      <types>DocumentRef.итОтгрузка</types>
      <types>DocumentRef.итПриемка</types>
      <types>DocumentRef.итЗадачиИнвентаризации</types>
      <types>DocumentRef.итПеремещение</types>
      <types>DocumentRef.итКонтрольнаяАгрегация</types>
      <types>DocumentRef.итРазмещение</types>
      <types>DocumentRef.итПроверка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗадачи</name>
    <type>
      <types>EnumRef.итWMSТипыЗадачТСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдЗадачи</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

wmsmobile/src/Documents/итНаборка/Forms/ФормаГрупповойПечатиSSCCФилиала/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриОткрытии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОбщийМодульКлиентскойЧасти.ПереопределенияТригераПолучениеШтрихКодаПриЗакрытии(ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не  Параметры.Свойство("ОбъектНаборки") Тогда 
		Отказ=Истина;
		Возврат
	КонецЕсли;
	Принтер=ПараметрыСеанса.Принтер;
	Объект=Параметры.ОбъектНаборки;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		Если ИмяСобытия="ОбработчикШтрихКода"  и ТригерПриемаСканераШтрихКода тогда
		Если Параметр=404 и Источник="ОшибкаЧтения" тогда
			ОбщийМодульКлиентскойЧасти.СообщитьЧерезФорму("Штрих код некорректен");
			Возврат
		КонецЕсли;	
		 ОбработчкаПолученияДанныхШтрихКода(Параметр);
	 КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбработчкаПолученияДанныхШтрихКода(ШтрихКод)
	УстановитьПринтерДляПечатиПоШтрихКоду(ШтрихКод);
КонецПроцедуры
&НаСервере
Процедура УстановитьПринтерДляПечатиПоШтрихКоду(ШтрихКод)
	СтруктураДанных=новый Структура;
	СлужебныеФункцииИПроцедурыКлиентСервер.СформироватьСтруктуруДанныхОПользователе(СтруктураДанных);
	СтруктураДанных.Вставить("КлючОперации","ПринтерПоШтрихКоду");
	СтруктураДанных.Вставить("Данные",НРег(ШтрихКод));
	СтруктураДанных=ОбработчикиЗапросаСервера.ЗапроситьДанные(СтруктураДанных,"ServiceFunction");
	Если 	СлужебныеФункцииИПроцедурыКлиентСервер.ТиповойОбработчикОшибок(СтруктураДанных,"ТекущийПринтерПредставление") тогда
		Возврат
	КонецЕсли;
	Если 	СлужебныеФункцииИПроцедурыКлиентСервер.ТиповойОбработчикОшибок(СтруктураДанных,"ТекущийПринтер") тогда
		Возврат
	КонецЕсли;
	Принтер=СтруктураДанных.ТекущийПринтерПредставление;
	КонецПроцедуры

&НаСервере
Процедура ПечатьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИтЗадачиНаТСД.ИдентификаторУпаковки КАК ИдентификаторУпаковки
		|ИЗ
		|	РегистрСведений.ИтЗадачиНаТСД КАК ИтЗадачиНаТСД
		|ГДЕ
		|	ИтЗадачиНаТСД.ДокументОснование = &ДокументОснование
		|	И ПОДСТРОКА(ИтЗадачиНаТСД.ИдентификаторУпаковки, 1, 12) = ПОДСТРОКА(ИтЗадачиНаТСД.ДокументОснование.FSRARID, 1, 12)";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СтруктураДанных=новый Структура;
	СлужебныеФункцииИПроцедурыКлиентСервер.СформироватьСтруктуруДанныхОПользователе(СтруктураДанных);
	СтруктураДанных.Вставить("КлючОперации","ПечатьSSCC");
	СтруктураДанных.Вставить("Принтер",Принтер);
	СтруктураДанных.Вставить("ИдентификаторУпаковки",ВыборкаДетальныеЗаписи.ИдентификаторУпаковки);
	СтруктураДанных=ОбработчикиЗапросаСервера.ЗапроситьДанные(СтруктураДанных,"ServiceFunction");
	СлужебныеФункцииИПроцедурыКлиентСервер.ТиповойОбработчикОшибок(СтруктураДанных);
	КонецЦикла;
	


КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
ПечатьНаСервере();
ЭтаФорма.Закрыть();
КонецПроцедуры
